MDCservice/EsPiFF/software/libs/libpq_esp32.cpp
/*
 * libpq_esp32.cpp
 *
 *  Created on: 26.02.2022
 *      Author: michi
 *  SPDX-FileCopyrightText: 2022 MDC Service <info@mdc-service.de>
 *  SPDX-License-Identifier: GPL-3.0-or-later
 *  Ported from SimplePgSQL (https://github.com/ethanak/SimplePgSQL) to ESP IDF
 *  original SimplePgSQL:  * Copyright (C) Bohdan R. Rau 2016 <ethanak@polip.com>
 */
 
#include "libpq_esp32.h"



#ifdef ESP32
#define strchr_P strchr
#endif

#ifdef PG_USE_MD5

/**
 * bytesToHex: convert bytes to HEX
 *
 * @param b byte array to con.vert
 * @param s string result
 */

static void
bytesToHex(const uint8_t b[16], char *s)
{
	int q, w;
#ifndef ESP32	
    static PROGMEM const char hex[] = "0123456789abcdef";
	for (q = 0, w = 0; q < 16; q++)
	{
		s[w++] = pgm_read_byte(&hex[(b[q] >> 4) & 0x0F]);
		s[w++] = pgm_read_byte(&hex[b[q] & 0x0F]);
	}
#else
    static const char hex[] = "0123456789abcdef";
	for (q = 0, w = 0; q < 16; q++)
	{
		s[w++] = hex[(b[q] >> 4) & 0x0F];
		s[w++] = hex[b[q] & 0x0F];
	}    
#endif	
	s[w] = '\0';
}

#ifdef ESP32_IDF
#include "esp_log.h" 
#endif

#ifdef ESP32
#include <mbedtls/md5.h>

/**
 * pg_md5_encrypt: md5 encryption for PostgreSQL
 *
 * @param password as unecrypted string
 * @param salt parameter string for the md5 algorithm
 * @param salt_len length of the salt parameter
 * @param outbuf is the resulting md5 encrypted password
 */

static void pg_md5_encrypt(const char *password, char *salt, int salt_len, char *outbuf)
{
    md5_context_t context;
	uint8_t sum[16];
    *outbuf++ = 'm';
    *outbuf++ = 'd';
    *outbuf++ = '5';
    mbedtls_md5_init(&context);
    mbedtls_md5_update_ret(&context, (uint8_t *)password, strlen(password));
    mbedtls_md5_update_ret(&context, (uint8_t *)salt, salt_len);
    mbedtls_md5_finish_ret( &context, sum);
	bytesToHex(sum, outbuf);
}
#elif defined(ESP8266)
#include <md5.h>
/**
 * pg_md5_encrypt: md5 encryption for PostgreSQL
 *
 * @param password as unecrypted string
 * @param salt parameter string for the md5 algorithm
 * @param salt_len length of the salt parameter
 * @param outbuf is the resulting md5 encrypted password
 */
static void pg_md5_encrypt(const char *password, char *salt, int salt_len, char *outbuf)
{
    md5_context_t context;
	uint8_t sum[16];
    *outbuf++ = 'm';
    *outbuf++ = 'd';
    *outbuf++ = '5';
    MD5Init(&context);
    MD5Update(&context, (uint8_t *)password, strlen(password));
    MD5Update(&context, (uint8_t *)salt, salt_len);
    MD5Final(sum, &context);
	bytesToHex(sum, outbuf);
}
#else
//#include <MD5.h>
/**
 * pg_md5_encrypt: md5 encryption for PostgreSQL
 *
 * @param password as unecrypted string
 * @param salt parameter string for the md5 algorithm
 * @param salt_len length of the salt parameter
 * @param outbuf is the resulting md5 encrypted password
 */
static void pg_md5_encrypt(const char *password, char *salt, int salt_len, char *outbuf)
{
	MD5_CTX context;
	uint8_t sum[16];
    *outbuf++ = 'm';
    *outbuf++ = 'd';
    *outbuf++ = '5';

    MD5::MD5Init(&context);
    MD5::MD5Update(&context, (uint8_t *)password, strlen(password));
    MD5::MD5Update(&context, (uint8_t *)salt, salt_len);
    MD5::MD5Final(sum, &context);
	bytesToHex(sum, outbuf);
}
#endif
#endif

#define MD5_PASSWD_LEN	35
#define AUTH_REQ_OK			0	/* User is authenticated  */
#define AUTH_REQ_PASSWORD	3	/* Password */
#define AUTH_REQ_MD5		5	/* md5 password */

#ifndef ESP32_IDF
static PROGMEM const char EM_OOM [] = "Out of memory";
static PROGMEM const char EM_READ [] = "Backend read error";
static PROGMEM const char EM_WRITE [] = "Backend write error";
static PROGMEM const char EM_CONN [] = "Cannot connect to server";
static PROGMEM const char EM_SYNC [] = "Backend out of sync";
static PROGMEM const char EM_INTR [] = "Internal error";
static PROGMEM const char EM_UAUTH [] = "Unsupported auth method";
static PROGMEM const char EM_BIN [] = "Binary format not supported";
static PROGMEM const char EM_EXEC [] = "Previous execution not finished";
static PROGMEM const char EM_PASSWD [] = "Password required";
static PROGMEM const char EM_EMPTY [] = "Query is empty";
static PROGMEM const char EM_FORMAT [] = "Illegal formatting character";
#else
static  const char EM_OOM [] = "Out of memory";
static  const char EM_READ [] = "Backend read error";
static  const char EM_WRITE [] = "Backend write error";
static  const char EM_CONN [] = "Cannot connect to server";
static  const char EM_SYNC [] = "Backend out of sync";
static  const char EM_INTR [] = "Internal error";
static  const char EM_UAUTH [] = "Unsupported auth method";
static  const char EM_BIN [] = "Binary format not supported";
static  const char EM_EXEC [] = "Previous execution not finished";
static  const char EM_PASSWD [] = "Password required";
static  const char EM_EMPTY [] = "Query is empty";
static  const char EM_FORMAT [] = "Illegal formatting character";

#define PGTAG "PGSQL"
#endif

#ifndef ESP32_IDF  
/**
 * PGconnection constructor for Arduino
 *
 * @param c the Arduino Client pointer
 * @param flags for the connection. See the postgresql libpq documentation for more details
 * @param memory specify buffer size
 * @param foreignBuffer specify is internal or external memory is used.
 */  
PGconnection::PGconnection(Client *c,
        int flags,
        int memory,
        char *foreignBuffer)
{
    conn_status = CONNECTION_NEEDED;
    client = c;
    Buffer = foreignBuffer;
    _passwd = NULL;
    _flags = flags & ~PG_FLAG_STATIC_BUFFER;

    if (memory <= 0) bufSize = PG_BUFFER_SIZE;
    else bufSize = memory;
    if (foreignBuffer) {
        _flags |= PG_FLAG_STATIC_BUFFER;
    }
}
#else

/**
 * PGconnection constructor for ESP IDF 
 *
 * @param flags for the connection. See the postgresql libpq documentation for more details
 * @param _Buffer points to the external allocated buffer
 * @param _bufSize specify the buffer size.
 */  
PGconnection::PGconnection(const int flags, const unsigned char *_Buffer, const int _bufSize) {
	conn_status = CONNECTION_NEEDED;
	_passwd = NULL;
	_user = NULL;
	Buffer = (char *) _Buffer;
	bufSize = _bufSize;
	bufPos = 0;
	result_status=0;
	_available=0;
	_nfields=0;
	_ntuples=0;
	_flags=0;
	
