MDCservice/EsPiFF/software/libs/libpq_esp32.cpp
#ifdef ESP8266

// there is no strchr_P in ESP8266 ROM :(

static const char *strchr_P(const char *str, char c)
{
    char z;
    for (;;) {
        z = pgm_read_byte(str);
        if (!z) return NULL;
        if (z == c) return str;
        str++;
    }
}

#endif

#ifdef ESP32_IDF
//emulate Arduino PSTR()

/**
 * PSTR.    
 *
 * @param str input string.
 * @returns the result string.
 */ 

char *PSTR(char *str)
{
   return str;
}
const char *PSTR(const char *str)
{
   return str;
}

//emulate strcpy_P()
/**
 * strcpy_P(). for compatibility with the Arduino version on ESP IDF   
 *
 * @param destination buffer.
 * @param source buffer. 
 * @returns number of bytes copied
 */ 
char *strcpy_P(char * destination, const char * source )
{
    return strcpy(destination, source);
}

int strlen_P(char *str)
{
   return strlen(str);
}
int strlen_P(const char *str)
{
   return strlen(str);
}
#endif

/**
 * PGconnection build_startup_packet.   
 *
 * @param packet buffer for the packet.
 * @param db name of the database.
 * @param charset name of the character set
 * @returns the lenght of the packet
 */ 

int PGconnection::build_startup_packet(
    char *packet,
    const char *db,
    const char *charset)
{
    int packet_len = 4;
    if (packet) {
        memcpy(packet,"\0\003\0\0", 4);
    }
#define ADD_STARTUP_OPTION(optname, optval) \
	do { \
		if (packet) \
			strcpy_P(packet + packet_len, (char *)optname); \
		packet_len += strlen_P((char *)optname) + 1; \
		if (packet) \
			strcpy(packet + packet_len, (char *)optval); \
		packet_len += strlen((char *)optval) + 1; \
	} while(0)

#define ADD_STARTUP_OPTION_P(optname, optval) \
	do { \
		if (packet) \
			strcpy_P(packet + packet_len, (char *)optname); \
		packet_len += strlen_P((char *)optname) + 1; \
		if (packet) \
			strcpy_P(packet + packet_len, (char *)optval); \
		packet_len += strlen_P((char *)optval) + 1; \
	} while(0)

	if (_user && _user[0])
		ADD_STARTUP_OPTION(PSTR("user"), _user);
	if (db && db[0])
		ADD_STARTUP_OPTION(PSTR("database"), db);
	if (charset && charset[0])
		ADD_STARTUP_OPTION(PSTR("client_encoding"), charset);
    ADD_STARTUP_OPTION_P(PSTR("application_name"), PSTR("arduino"));
#undef ADD_STARTUP_OPTION
	if (packet)
		packet[packet_len] = '\0';
	packet_len++;

	return packet_len;
}

/**
 * PGconnection pqPacketSend.   
 *
 * @param pack_type type of the packet.
 * @param buf the result buffer.
 * @param buf_len length of the result buffer
 * @progmem to be used on Arduino
 * @returns 0 if success, network error code otherwise
 */ 

int PGconnection::pqPacketSend(char pack_type, const char *buf, int buf_len, int progmem)
{
    char *start = Buffer;
    int l = bufSize - 4;
#ifndef ESP32    
    int n;
#endif    
    if (pack_type) {
        *start++ = pack_type;
        l--;
    }
#ifdef __AVR__
    *start++=0;
    *start++=0;
#else
    *start++ = ((buf_len + 4) >> 24) & 0xff;
    *start++ = ((buf_len + 4) >> 16) & 0xff;
#endif
    *start++ = ((buf_len + 4) >> 8) & 0xff;
    *start++ = (buf_len + 4) & 0xff;
#ifndef ESP32
    if (progmem) {
        while (buf_len > 0) {
            while (buf_len > 0 && l > 0) {
                *start++ = pgm_read_byte(buf++);
                buf_len--;
            }
            n = client->write((const uint8_t *)Buffer, start - Buffer);
            if (n != start - Buffer) return -1;
            start = Buffer;
            l = bufSize;
        }
    }
    else {
#endif
        if (buf) {
            if (buf_len <= l) {
                memcpy(start, buf, buf_len);
                start += buf_len;
                buf_len = 0;
            }
            else {
                memcpy(start, buf, l);
                start += l;
                buf_len -= l;
                buf += l;
            }
        }
#ifndef ESP32_IDF        
        n = client->write((const uint8_t *)Buffer, start - Buffer);
        if (n != start - Buffer) return -1;
        if (buf && buf_len) {
            n = client->write((const uint8_t *)buf, buf_len);
            if (n != buf_len) return -1;
        }        
#else
	int err = send(SockH, /*_buffer*/Buffer, start - /*_buffer*/Buffer, 0);
	if (err < 0) {
		ESP_LOGE(PGTAG, "pqPacketSend: Send Error occurred during sending: errno %d", errno);
		return err;
	}
	if (buf && buf_len) {
		err = send(SockH, (const char *) buf, (size_t) buf_len, 0);
		if (err < 0) {
			ESP_LOGE(PGTAG, "Send2 Error occurred during sending: errno %d", errno);
			return err;

		}
	}	
#endif        

#ifndef ESP32
    }
#endif
    return 0;
}

/**
 * PGconnection pqGetc.   
 *
 * @param buf buffer to store received char.
 * @returns length of received data
 */ 

int PGconnection::pqGetc(char *buf)
{
    int i;
#ifndef ESP32_IDF    
    for (i=0; !client->available() && i < 10; i++) {
        delay (i * 10 + 10);
    }
    if (!client->available()) {
        return -1;
    }
    *buf = client->read();
    return 0;
#else    
        i = 0;
	while (i<10) {
		if (dataAvailable()>0) break;
		else {
			vTaskDelay(i++);
		}
	}
	if (i==10) return -1;

	int len = read(SockH, (void *) buf, 1);
	_available-=len;
	return -1+len;    
#endif    
}

/**
 * PGconnection pqGetInt4.   
 *
 * @param result the converted result to int4.
 * @returns 0 for sucess, otherwise -1.
 */ 

int PGconnection::pqGetInt4(int32_t *result)
{
	uint32_t tmp4 = 0;
    byte tmp,i;
    for (i = 0; i < 4; i++) {
        if (pqGetc((char *)&tmp)) return -1;
        tmp4 = (tmp4 << 8) | tmp;
    }
    *result = tmp4;
    return 0;
}

/**
 * PGconnection pqGetInt2.   
 *
 * @param result the converted result to int2.
 * @returns 0 for sucess, otherwise -1.
 */ 

int PGconnection::pqGetInt2(int16_t *result)
{
	uint16_t tmp2 = 0;
    byte tmp,i;
    for (i = 0; i < 2; i++) {
        if (pqGetc((char *)&tmp)) return -1;
        tmp2 = (tmp2 << 8) | tmp;
    }
    *result = tmp2;
    return 0;
}

/**
 * PGconnection pqGetnchar.   
 *
 * @param s the string to search in
 * @param len the lenght of the string
 * @returns 0 for sucess, otherwise -1.
 */ 

