MDCservice/EsPiFF/software/libs/libpq_esp32.cpp
    return 0;
}

/**
/* PGconnection writeFormattedQuery.   
 *
 * @param length the length of the message
 * @param progmem the command
 * @param format format string
 * @param va parameters
 * @returns 0 on success, or -1 for an error
 */ 
int32_t PGconnection::writeFormattedQuery(int32_t length, int progmem, const char *format, va_list va)
{
    int32_t msgLen = 0;
    const char *percent;
    int blen, rc;
    char buf[32], znak;
#ifdef ESP32
        (void) progmem;
#endif
    if (length) {
        length += 4;
        bufPos = 0;
        Buffer[bufPos++] = 'Q';
        Buffer[bufPos++] = (length >> 24) & 0xff;
        Buffer[bufPos++] = (length >> 16) & 0xff;
        Buffer[bufPos++] = (length >> 8) & 0xff;
        Buffer[bufPos++] = (length) & 0xff;
    }
    for (;;) {
#ifndef ESP32
        if (progmem) {
            percent = strchr_P(format, '%');
        }
        else {
#endif
            percent = strchr(format, '%');
#ifndef ESP32
        }
#endif
        if (!percent) break;
#ifndef ESP32
        if (progmem) {
            znak = pgm_read_byte(percent+1);
        }
        else {
#endif
            znak = percent[1];
#ifndef ESP32
        }
#endif
        if (!length) {
            msgLen += (percent - format);
        }
        else {
#ifndef ESP32
            if (progmem) {
                rc = writeMsgPart_P(format, percent - format, false);
            }
            else {
#endif
                rc = writeMsgPart(format, percent - format, false);
#ifndef ESP32
            }
#endif
            if (rc) goto write_error;
        }
        format = percent + 2;
        if (znak == 's' || znak == 'n') {
            char *str = va_arg(va, char *);
            blen = (znak == 's') ? escapeString(str, NULL) : escapeName(str, NULL);
            if (!length) {
                msgLen += blen;
            }
            else {
                if (bufPos + blen > bufSize) {
                    rc = writeMsgPart(NULL, 0, true);
                    if (rc) goto write_error;
                }
            }
            if (znak == 's') {
                escapeString(str, Buffer + bufPos);
            }
            else {
                escapeName(str, Buffer + bufPos);
            }
            bufPos += blen;
            continue;
        }
        if (znak == 'l' || znak == 'd') {
            if (znak == 'l') {
                long n = va_arg(va, long);
                blen = snprintf(buf, 32, "'%ld'", n);
            }
            else {
                int n = va_arg(va, int);
                blen = snprintf(buf, 32, "'%d'", n);
            }
            if (length) {
                rc = writeMsgPart(buf, blen, false);
                if (rc) goto write_error;
            }
            else {
                msgLen += blen;
            }
        }
        setMsg_P(EM_FORMAT, PG_RSTAT_HAVE_ERROR);
        return -1;
    }
#ifndef ESP32
    if (progmem) {
        blen = strlen_P(format);
    }
    else {
#endif
        blen = strlen(format);
#ifndef ESP32
    }
#endif
    if (length) {
#ifndef ESP32
        if (progmem) {
            rc = writeMsgPart_P(format, blen, false);
        }
        else {
#endif
            rc = writeMsgPart(format, blen, false);
#ifndef ESP32
        }
#endif
        if (!rc) {
            rc = writeMsgPart("\0",1,true);
        }
        if (rc) goto write_error;
    }
    else {
        msgLen += blen + 1;
    }
    return msgLen;
write_error:
    setMsg_P(EM_WRITE, PG_RSTAT_HAVE_ERROR);
    conn_status = CONNECTION_BAD;
    return -1;
}
